app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
          <td class="col-URL"><%= post.url %></td>
          <td class="center-align"><%= "#{post.post_votes.count}"%></td>