app/views/posts/show.html.erb

  <tbody id="comments_list">
    <% @post.comments.reverse.each do |com| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]