app/controllers/comments_controller.rb

  def create
    # creates an instance of the record
    # that hasn't been saved yet
    #comment = Comment.new(comment_params)
    # @comment = current_user.comments.new(comment_params)
   puts params[:comment][:comment]
   puts params[:comment][:post_id]

    @comment = Comment.new(
      :comment => params[:comment][:comment],
      :post_id => params[:comment][:post_id],
      :user_id => current_user.id)

    if @comment.save
---
INSERT INTO "comments" ("articleID", "comment", "created_at", "updated_at", "userID") VALUES (?, ?, ?, ?, ?)  [["articleID", 2], ["comment", "Let's try again - This article was really terrible"], ["created_at", "2014-12-11 04:05:19.374258"], ["updated_at", "2014-12-11 04:05:19.374258"], ["userID", 1]]

  def show
    # params[:id] will look for the id in the URL
    # this will retrieve the post with a specific id
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]