app/controllers/posts_controller.rb

  def create
    # WHERE DOES CURRENT_USER COME FROM??
    post = current_user.posts.new(post_params)
    # creates an instance of the record
    # that hasn't been saved yet
    # post = Post.new(post_params)

    if post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-12 06:35:38.604854"], ["title", "asd"], ["updated_at", "2014-12-12 06:35:38.604854"], ["url", "http://www.google.com"], ["user_id", 1]]

  def show
    # params[:id] will look for the id in the URL
    # this will retrieve the post with a specific id
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]