app/controllers/users_controller.rb

  def show
    # params[:id] will look for the id in the URL
    # this will retrieve the post with a specific id
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1